#### Terraform Plan Changes detected

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_repository_permissions.repos["example-repo"] will be created
  + resource "github_actions_repository_permissions" "repos" {
      + allowed_actions      = "all"
      + enabled              = true
      + id                   = (known after apply)
      + repository           = "example-repo"
      + sha_pinning_required = (known after apply)
    }

  # github_repository.repos["example-repo"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge                        = true
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + archived                                = false
      + auto_init                               = true
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "Example repository created with Terraform"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "example-repo"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "PR_BODY"
      + squash_merge_commit_title               = "PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "infrastructure-as-code",
          + "terraform-managed",
        ]
      + visibility                              = "public"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis (known after apply)
    }

  # github_repository_ruleset.main_branch_protection["example-repo"] will be created
  + resource "github_repository_ruleset" "main_branch_protection" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Protect main branch"
      + node_id     = (known after apply)
      + repository  = "example-repo"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_workflow_repository_permissions.repos["example-repo"] will be created
  + resource "github_workflow_repository_permissions" "repos" {
      + can_approve_pull_request_reviews = true
      + default_workflow_permissions     = "read"
      + id                               = (known after apply)
      + repository                       = "example-repo"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + copilot_firewall_allowlist = [
      + "registry.terraform.io",
      + "checkpoint-api.hashicorp.com",
      + "api0.prismacloud.io",
    ]
  + organization               = "nathlan"
  + repositories               = {
      + example-repo = {
          + branch_protection_id = (known after apply)
          + default_branch       = "main"
          + full_name            = (known after apply)
          + html_url             = (known after apply)
          + http_clone_url       = (known after apply)
          + id                   = (known after apply)
          + name                 = "example-repo"
          + ssh_clone_url        = (known after apply)
        }
    }
  + repository_count           = 1

```

</details>

*Pusher: @Copilot, Working Directory: `terraform`, Workflow: `CI/CD - Terraform - GitHub Provider`*